using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Plan : MonoBehaviour {

    ///기획서

    /*제목
        Beyond Space
        우주 너머
    */

    /*대 주제
        달의 안전성 테스트를 위하여 탐사 및 테스트
    */

    /*스토리

        20xx년, 월면에서 발견한 [특정 물질]이 천문학적인 금액을 가치를 지닌 것을 알게된 PCM은 남몰래
        탐사원을 보내 안전성 확보 및 수집을 나서게 된다.

        주인공 ㅁㅁㅁ은 그저 안전성 테스트를 하라는 임무를 받고 탐사를 떠나게 된다.

        처음에는 주변 지역의 안전성을 확보하면서 탐사를 진행하였다.
        하지만 지난 탐사원이 방사능 폐기물을 두고 갔다며
        이를 수집하라는 명령으로 수집을 하면서 탐사를 계속 해나가다 [정체불명의 물건]과 만나게 되고,
        이 [정체불명의 물건]에 다가가자, [???]이 쫓아오게 된다.

        [???]를 피해 도망가다 지반이 약한 땅이 무너져 간신히 피하지만,
        하필 그 곳이 [???]의 본거지였고, 그 이후로는 알 수 없게 된다.
        (또는 눈 뜨니 생체실험으로...?)
    */

    /*진행 방식
        [지구]
        1) 우주선 탑승 -> 의자에 앉은채 외부에서 그대로 우주선 내부로
        2) 우주선 90도 회전 -> 모션디바이스도 회전
        3) 우주선 발사 -> 모션디바이스 진동

        [우주]
        1) 태양과 지구, 달이 보임
        2) 달을 향해 항해

        [달]
        1) 우주선 착륙
        2) 
    */


}
